const lat = 38.2112755399349;   // 緯度 = 38.2113254
const lng = 140.907587676052;   // 経度 = 140.9071296
const zoom = 13;                // ズームレベル

const map = L.map('map').setView([lat,lng], zoom);
// const map = L.map('map').setView([38.2113254,140.9071296], 13);

// 標準地図: std, 単色地図: ,pale 白地図: blank,
// 写真: seamlessphoto （拡張子は，jpg）
// 治水地形分類図: lcmfc2, 明治期の低湿地: swale
var t_pale = new L.tileLayer('https://cyberjapandata.gsi.go.jp/xyz/pale/{z}/{x}/{y}.png',{
      attribution: '&copy; <a href = "https://maps.gsi.go.jp/development/ichiran.html"  target="_blank">地理院タイル</a>'
 });

var t_photo = new L.tileLayer('https://cyberjapandata.gsi.go.jp/xyz/seamlessphoto/{z}/{x}/{y}.jpg',{
      attribution: '&copy; <a href = "https://maps.gsi.go.jp/development/ichiran.html"  target="_blank">地理院タイル</a>'
 });

var Map_BaseLayer = {
  "地理院地図 淡色": t_pale,
  "地理院地図 写真": t_photo,
};

// L.control.scale().addTo(map);
// layersコントロールに Map_BaseLayer オブジェクトを設定して地図に追加
// コントロール内にプロパティ名が表示されます．
// L.control.layers(Map_BaseLayer, null, { collapsed: false }).addTo(map);
L.control.layers(Map_BaseLayer).addTo(map);
// 初期表示地図 t_pale を指定します．
t_pale.addTo(map);

// マーカーを追加
var marker = L.marker([lat,lng]).addTo(map);

//上のマーカーにポップアップを追加する。
marker.bindPopup("旧笊川排水機場 No.1～5 ポンプ").openPopup();

// GeoJSONオブジェクトを定義する
var geojsonFeature = {
  "type": "FeatureCollection",
    "features": [
      {
      "type": "Feature",
      "properties": {
        "name": "機場本体",
        "_color": "#000000",            // 黒（機能していない）
        "_fillColor": "#ff0000",        // 赤
        "_opacity": 0.5,
        "_weight": 2,
      },
      "geometry": {
        "type": "Polygon", // ジオメトリのタイプを指定する．今回は面描画
        /*
          type は，LineString が線描画で OK です．
          type は，Point は OK ですが Marker が付きます．
          Circle や CircleMarker は，NG
          LineString の記述は，"coordinates": [[経度,緯度],…,[経度,緯度]]
          Polygon の記述は，"coordinates": [[[経度,緯度],…,[経度,緯度]]]
          Polygon では，LineString より [] が多い．
        */
        "coordinates": [
          // 位置情報，経度と緯度を指定する．
          [
            [140.907611407765,38.2112960279221],        // 機場本体(6)
            [140.907462867981,38.2112999996145],        // 機場本体(7)
            [140.907455752794,38.2111357037703],        // 機場本体(8)
            [140.907604292243,38.2111317320779],        // 機場本体(9)
            [140.907611407765,38.2112960279221]         // 機場本体(6)
          ]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "導水路A",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 3
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [140.907463037765,38.2113001079221],  // 導水路A（11）
          [140.907234515,38.211306218218],      // 導水路A（12）
          [140.907227399994,38.2111419223739],  // 導水路A（13）
          [140.907455922243,38.2111358120779]   // 導水路A（14）
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "導水路B",
        "_color": "#313131",
        "_opacity": 0.5,
        "_weight": 1
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [140.907234934832,38.2113064694652],          // 導水路B（15）
          [140.907113817766,38.2113097079221],          // 導水路B（16）
          [140.907106702242,38.2111454120779],          // 導水路B（17）
          [140.907227819035,38.2111421736211]           // 導水路B（18）
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "護床",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 3
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [140.90821940257,38.2113076283543],
          [140.907856416955,38.2113173339484],
          [140.907846852931,38.2110964772398],
          [140.908209837444,38.2110867716457],
          [140.90821940257,38.2113076283543]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "操作室",
        "_markerType": "CircleMarker",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 2,
      },
      "geometry": {
        "type": "Polygon", // ジオメトリのタイプを指定する．今回は面描画
        // "type": "LineString", // ジオメトリのタイプを指定する．今回は線描画
        "coordinates": [
          [
            // 位置情報，経度と緯度を指定する．
            [140.907791032851,38.2118280861483],
            [140.907703336608,38.2118304309744],
            [140.907701820173,38.211795417106],
            [140.907619837113,38.2117976091747],
            [140.907613149618,38.211643189037],
            [140.907782828545,38.2116386521422],
            [140.907789516412,38.2117930722799],
            [140.907775804954,38.2117934388977],
            [140.907776582613,38.2118113947276],
            [140.907790294074,38.2118110281099],
            [140.907791032851,38.2118280861483]
          ]
        ]
      }
    },
/*
    {
      "type": "Feature",
      "properties": {
        "name": "操作室",
        "popupContent": "操作室",
        "_markerType": "Circle",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 3,
        "_fillColor": "#ff0000",
        "_fillOpacity": 0.5,
        "_radius": 1
      },
      "geometry": {
        "type": "Point",
        "coordinates": [140.907791032851,38.2118280861483]
      }
    },
*/
    {
      "type": "Feature",
      "properties": {
        "name": "No.1 ポンプ",
        "amenity": "Pump",
        // "_markerType": "CircleMarker",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 3,
        "_fillColor": "#ff0000",
        "_fillOpacity": 0.5,
        "_radius": 1.275
      },
      "geometry": {
        "type": "Polygon", // ジオメトリのタイプを指定する．今回は面描画
        /*
          Circle としたいが機能しないため，Polygon で 12角形を作ります．
        */
        "coordinates": [
          [
            // 位置情報，経度と緯度を指定する．
            [140.907594964429,38.2112854589287],
            [140.907600299891,38.2112812666687],
            [140.907602252804,38.2112755399349],
            [140.907600299889,38.2112698132012],
            [140.907594964427,38.2112656209411],
            [140.907587676052,38.2112640864675],
            [140.907580387676,38.2112656209411],
            [140.907575052214,38.2112698132012],
            [140.907573099299,38.2112755399349],
            [140.907575052212,38.2112812666687],
            [140.907580387674,38.2112854589287],
            [140.907587676052,38.2112869934024],
            [140.907594964429,38.2112854589287]
          ]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "No.2 ポンプ",
        "amenity": "Pump",
        // "_markerType": "CircleMarker",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 3,
        "_fillColor": "#ff0000",
        "_fillOpacity": 0.5,
        "_radius": 1.275
      },
      "geometry": {
        "type": "Polygon", // ジオメトリのタイプを指定する．今回は面描画
        "coordinates": [
          [
            // 位置情報，経度と緯度を指定する．
            [140.907593642415,38.2112549340178],
            [140.907598977875,38.2112507417577],
            [140.907600930788,38.211245015024],
            [140.907598977873,38.2112392882903],
            [140.907593642413,38.2112350960302],
            [140.907586354041,38.2112335615565],
            [140.907579065668,38.2112350960302],
            [140.907573730209,38.2112392882903],
            [140.907571777294,38.211245015024],
            [140.907573730207,38.2112507417577],
            [140.907579065666,38.2112549340178],
            [140.907586354041,38.2112564684915],
            [140.907593642415,38.2112549340178]
          ]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "No.3 ポンプ",
        "amenity": "Pump",
        // "_markerType": "CircleMarker",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 3,
        "_fillColor": "#ff0000",
        "_fillOpacity": 0.5,
        "_radius": 1.275
      },
      "geometry": {
        "type": "Polygon", // ジオメトリのタイプを指定する．今回は面描画
        "coordinates": [
          [
            // 位置情報，経度と緯度を指定する．
            [140.907592320402,38.2112244091068],
            [140.907597655859,38.2112202168468],
            [140.907599608771,38.2112144901131],
            [140.907597655857,38.2112087633793],
            [140.9075923204,38.2112045711193],
            [140.907585032031,38.2112030366456],
            [140.907577743661,38.2112045711193],
            [140.907572408204,38.2112087633793],
            [140.90757045529,38.2112144901131],
            [140.907572408202,38.2112202168468],
            [140.907577743659,38.2112244091068],
            [140.907585032031,38.2112259435805],
            [140.907592320402,38.2112244091068]
          ]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "No.4 ポンプ",
        "amenity": "Pump",
        // "_markerType": "CircleMarker",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 3,
        "_fillColor": "#ff0000",
        "_fillOpacity": 0.5,
        "_radius": 1.275
      },
      "geometry": {
        "type": "Polygon", // ジオメトリのタイプを指定する．今回は面描画
        "coordinates": [
          [
            // 位置情報，経度と緯度を指定する．
            [140.90759099839,38.2111938841959],
            [140.907596333845,38.2111896919359],
            [140.907598286756,38.2111839652021],
            [140.907596333843,38.2111782384684],
            [140.907590998388,38.2111740462083],
            [140.907583710022,38.2111725117346],
            [140.907576421655,38.2111740462083],
            [140.9075710862,38.2111782384684],
            [140.907569133287,38.2111839652021],
            [140.907571086198,38.2111896919359],
            [140.907576421653,38.2111938841959],
            [140.907583710022,38.2111954186696],
            [140.90759099839,38.2111938841959]
          ]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "No.5 ポンプ",
        "amenity": "Pump",
        // "_markerType": "CircleMarker",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 3,
        "_fillColor": "#ff0000",
        "_fillOpacity": 0.5,
        "_radius": 1.275
      },
      "geometry": {
        "type": "Polygon", // ジオメトリのタイプを指定する．今回は面描画
        "coordinates": [
          [
            // 位置情報，経度と緯度を指定する．
            [140.907589676378,38.211163359285],
            [140.907595011831,38.2111591670249],
            [140.907596964742,38.2111534402912],
            [140.907595011829,38.2111477135574],
            [140.907589676376,38.2111435212974],
            [140.907582388013,38.2111419868237],
            [140.90757509965,38.2111435212974],
            [140.907569764197,38.2111477135574],
            [140.907567811285,38.2111534402912],
            [140.907569764195,38.2111591670249],
            [140.907575099648,38.211163359285],
            [140.907582388013,38.2111648937586],
            [140.907589676378,38.211163359285]
          ]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "No.1 吐出管",
        "amenity": "discharge pipe",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 2
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [140.907601387412,38.2112751733172],
          [140.907952889507,38.2112657747654]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "No.2 吐出管",
        "amenity": "discharge pipe",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 2
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [140.907600065395,38.2112446484062],
          [140.907951567343,38.2112352498545]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "No.3 吐出管",
        "amenity": "discharge pipe",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 2
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [140.907598743379,38.2112141234953],
          [140.90795024518,38.2112047249436]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "No.4 吐出管",
        "amenity": "discharge pipe",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 2
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [140.907597421364,38.2111835985844],
          [140.907948923018,38.2111742000326]
        ]
      }
    },
    {
      "type": "Feature",
      "properties": {
        "name": "No.5 吐出管",
        "amenity": "discharge pipe",
        "_color": "#000000",
        "_opacity": 0.5,
        "_weight": 2
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [140.90759609935,38.2111530736734],
          [140.907947600856,38.2111436751217]
        ]
      }
    },
  ]
};
// GeoJSONオブジェクトを地図に追加する
L.geoJSON(geojsonFeature).addTo(map);

/*
var geojsonLayer = L.geoJSON('q-zaru.geojson');
geojsonLayer.addTo(map);
*/
